# Install via Homebrew:
#   `brew bundle --file=~/.dotfiles/homebrew/.Brewfile`

# third-party repositories 
tap 'homebrew/cask'

# cli utitlities
brew 'ssh-copy-id'  # installs ssh key as an authorized key
brew 'fasd'     # Fast directory switcher
brew 'gibo'     # quickly access Github's git ignore templates
brew 'less'     # outputs file or commmand a single page at a time
brew 'lesspipe' # pre-processes various file formats so they can be paged via Less
brew 'ctags'    # tool to generate index file of names found in source and header files
brew 'stow'     # symlink manager (used to link these dotfiles on a machine)
brew 'htop'     # improved top 
brew 'iftop'    # network bandwidth monitoring tool
brew 'ag'       # faster grep
brew 'ripgrep'  # faster grep (which is better)
brew 'bat'      # better cat
brew 'ncdu'     # ncurses-based directory/file size viewer
brew 'tree'     # recursively list contents of a directory in tree like structure
brew 'navi'     # terminal cheatsheets
brew 'tmux'     # terminal multiplexer
brew 'neovim'   # terminal text editor
brew 'pipx'     # ??
brew 'git'      # ??
brew 'zsh'      # ??
brew 'lazygit'  # ??
## maybe remove these below
brew 'shellcheck' # ??
brew 'yamllint'   # ??

# applications
#cask 'wezterm'          # rust based gpu accelerated terminal
#cask 'rectangle'        # macos window management tools
#cask 'scroll-reverser'  # mouse management tools
#cask 'cyberduck'        # ?

# environments - using rtx (asdf clone) instead
